OpenFOAM-13/tutorials/multiRegion/CHT/multiphaseCoolingCylinder2D/constant/fluid/momentumTransfer
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      momentumTransfer;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

drag
{
    blending            segregated;

    oil_dispersedIn_water
    {
        type            SchillerNaumann;
    }

    water_dispersedIn_oil
    {
        type            SchillerNaumann;
    }

    oil_segregatedWith_water
    {
        type            segregated;
        m               0.5;
        n               8;
    }
}

virtualMass
{
    oil_dispersedIn_water
    {
        type            constantCoefficient;
        Cvm             0.5;
    }

    water_dispersedIn_oil
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
}

lift
{}

wallLubrication
{}

turbulentDispersion
{}

// ************************************************************************* //
